# 레디스 키 관리

Redis 키는 binary safe하며, "foo"와 같은 문자열부터 JPEG 파일의 내용까지 모든 이진 시퀀스를 키로 사용할 수 있으며, 빈 문자열도 유효한 키로 사용할 수 있다.

- 매우 긴 키는 좋은 아이디어 아님
  - 예를 들어, 1024 바이트의 키는 메모리 측면뿐만 아니라 데이터셋에서 키를 조회하는 데도 여러 비용이 소요될 수 있음
  - 대용량 값을 일치시키는 작업이라 할지라도 해당 값을 해싱하는 것이 더 나은 아이디어
- 매우 짧은 키도 종종 좋은 아이디어가 아님
  - "u1000flw"와 같은 짧은 키 대신 "user:1000:followers"와 같이 읽기 쉬운 형태로 작성하는 것이 좋음
  - 짧은 키는 메모리를 조금 덜 사용할 수 있지만, 적절한 균형을 찾는 것이 중요
- 스키마를 유지하는 것이 좋음 
  - 예를 들어, "object-type:id" 형태인 "user:1000"과 같은 스키마를 사용
- 최대 허용 키 크기는 512MB

## 키의 자동 생성과 삭제

stream이나, set, sorted set, hash와 같이 하나의 키에 여러 개의 아이템을 가지고 있는 자료 구조에서는 명시적으로 키를 생성하거나 삭제하지 않아도 키는 알아서 생성되고 삭제된다. 아래의 3가지 공통적인 규칙을 따른다.

1. 키가 존재하지 않을 때 아이템을 넣으면 아이템을 삽입하기 전에 빈 자료 구조를 생성한다.
2. 모든 아이템을 삭제하면 키도 자동으로 삭제된다.(stream은 예외)
3. 키가 없는 상태에서 키 삭제, 아이템 삭제, 자료 구조 크기 조회 같은 읽기 전용 커맨드를 수행하면 에러를 반환하는 대신 키가 있으나 아이템이 없는 것처럼 동작한다.

```shell
### 예시 1
> DEL mylist
(integer) 1

> LPUSH mylist 1 2 3
(integer) 3

### 예시 2
> SET hello world
OK
> LPUSH hello 1 2 3
(error) WRONGTYPE Operation against a key holding the wrong kind of value

> TYPE hello
string

### 예시 3
> EXISTS mykey
(integer) 0

> DEL mykey
(integer) 0

> LLEN mykey
(integer) 0

> LPOP mykey
(nil)
```

## 키와 관련된 커맨드

### 키의 조회

#### EXISTS

- 키의 존재 여부를 하는 커맨드
- 존재하면 1을 반환하고, 그렇지 않으면 0을 반환
- 대소문자 구분함

```shell
> SET hello world
OK

> EXISTS hello
(integer) 1

> EXISTS HELLO
(integer) 0
```

#### KEYS

- 레디스에 저장된 모든 키를 조회하는 커맨드
- 매칭되는 패턴에 해당하는 모든 키의 list를 반환, 패턴은 글롭 패턴(Glob pattern)스타일로 동작
- **위험한 커맨드로 사용을 지양해야함**
  - 레디스는 싱글 스레드로 동작하기 때문에 저장된 키가 많을 경우 다른 클라이언트 응답이 지연될 수 있음

```shell
> KEYS b*
1) "bikes:rentable"
2) "b"
```

#### SCAN

- `KEYS`를 대체해 키를 조회할 때 사용할 수 커맨드로 커서 기반으로 특정 범위의 키를 조회
- 처음 조회할 때 커서는 `0`을 입력
- COUNT 옵션을 사용하여 한 번에 반환되는 키의 개수를 조정할 수 있음
  - 데이터가 저장된 형상에 따라 몇 개의 키를 더 반환하기도 함
- MATCH 옵션을 사용하여 입력한 패턴에 맞는 키를 조회할 수 있음
  - 데이터를 우선 필터링 없이 스캔한 다음 데이터를 반환하기 직전에 필터링하는 방식으로 동작함
- TYPE 옵션을 사용하여 지정한 타입의 키만 조회할 수 있음
```shell
> SCAN 0
1) "30"
2)  1) "b"
    2) "mylist"
    3) "admins"
    4) "travel"
    5) "foo"
    6) "c"
    7) "bikes:rentable"
    8) "members"
    9) "score:220817"
   10) "Product:123"
   
### COUNT 옵션   
> SCAN 0 COUNT 5
1) "6"
2) 1) "b"
   2) "mylist"
   3) "admins"
   4) "travel"
   5) "foo"
   6) "c"

### MATCH 옵션   
> SCAN 0 MATCH b*
1) "30"
2) 1) "b"
   2) "bikes:rentable"
   
### TYPE 옵션
> SCAN 0 TYPE list
1) "30"
2) 1) "mylist"
```

#### SORT

- 키 내부의 아이템을 정렬해 반환하는 커맨드로 list, set, sorted set에서만 사용할 수 있음
  - 실제 데이터가 정렬되어 저장되는 것은 아님
- LIMIT 옵션을 사용하여 일부 데이터만 조회 가능
- ASC/DESC 옵션을 사용하여 정렬 순서를 변경할 수 있음
- 정렬할 대상이 문자열일 겨우 ALPHA 옵션을 사용하여 사전 순으로 정렬해 조회할 수 있음

```shell
> LRANGE mylist 0 -1
1) "3"
2) "2"
3) "1"

> SORT mylist
1) "1"
2) "2"
3) "3"

> LRANGE mylist 0 -1
1) "3"
2) "2"
3) "1"
```

#### RENAME / RENAMENX

- 키의 이름을 변경하는 커맨드
- `RENAMENX`는 오직 변경할 키가 존재하지 않을 때에만 동작

#### COPY

- Source에 지정된 키를 destination 키에 복사
- destination에 지정한 키가 이미 있는 경우 에러를 반환, REPLACE 옵션
  - O(N)의 시간복잡도를 가지는 커맨드로 아이템이 많이 저장된 키를 복사할 경우 주의해야함

```shell
> SET B BANANA
OK

> COPY B BB
(integer) 1

> GET B
"BANANA"

> GET BB
"BANANA"
```

#### TYPE

- 지정한 키의 자료 구조 타입을 반환

```shell
> TYPE hello
string

> TYPE mylist
list
```

#### OBJECT

- 키에 대한 상세 정보를 반환
- 키가 내부적으로 어떻게 저장됐는지, 혹은 키가 호출되지 않은 시간이 얼마나 됐는지 등을 확인할 수 있음

```shell
> OBJECT ENCODING mylist
"listpack"

> OBJECT IDLETIME mylist
(integer) 2869
```

### 키의 삭제

#### FLUSHALL

- 레디스에 저장된 모든 키를 삭제
- 기본은 SYNC한 방식으로 동작해 커맨드가 실행되는 도중에 다른 응답을 처리할 수 없음
- ASYNC 옵션을 사용해 백그라운드로 실행할 수 있지만 커맨드 입력 이후 새로 추가된 키는 삭제되지 않음
- `lazyfree-lazy-user-fiush` 옵션이 yes인 경우 ASYNC 옵션 없이 커맨드를 사용하더라도 백그라운드로 키 삭제 작업이 동작

#### DEL

- 키와 키에 저장된 모든 아이템을 삭제하는 커맨드
- 기본적으로 동기적으로 작동

#### UNLINK

- 키와 데이터를 삭제하는 커맨드이지만 백그라운드에서 다른 스레드에 의해 처리됨
- 우선 키와 연결된 데이터의 연결을 끊음
- 하나의 키에 여러개의 아이템이 저장될 수 있는 자료 구조를 지울 때는 `UNLINK` 커맨드를 사용하는게 좋음

### 키의 만료 시간

#### EXPIRE

- 키가 만료될 시간을 초 단위로 지정
- 아래 옵션과 함께 사용할 수 있음
  - `NX` - 해당 키에 만료 시간이 정의돼 있지 않을 경우에만 커맨드 수행
  - `XX` - 해당 키에 만료 시간이 정의돼 있을 때에만 커맨드 수행
  - `GT` - 현재 키가 가지고 있는 만료 시간보다 새로 입력한 초가 더 클 때에만 수행
  - `LT` - 현재 키가 가지고 있는 만료 시간보다 새로 입력한 초가 더 작을 때에만 수행

#### EXPIREAT

- 키가 특정 유닉스 타임스탬프에 만료될 수 있도록 키의 만료 시간을 직접 지정
- 사용할 수 있는 옵션은 `EXPIRE`와 동일

#### EXPIRETIME

- 키가 삭제되는 유닉스 타임스탬프를 초 단위로 반환
- 키가 존재하지만 만료 시간이 설정돼 있지 않은 경우 -1, 키가 없을 때는 -2를 반환 

#### TTL

- 키가 몇 초 뒤에 만료되는지 반환
- 키가 존재하지만 만료 시간이 설정돼 있지 않은 경우 -1, 키가 없을 때는 -2를 반환
